In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  01-01-17           32          6   Rain
1  01-02-17       -99999          7  Sunny
2  01-03-17           28     -99999   Snow
3  01-04-17       -99999          7      0
4  01-05-17           32     -99999   Rain
5  01-06-17           31          2  Sunny
6  01-06-17           34          5      0

In [2]:
new_df=df.replace(-99999,np.NaN)
new_df

        day  temperature  windspeed  event
0  01-01-17         32.0        6.0   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17          NaN        7.0      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [3]:
#use dictionary
new_df=df.replace({'temperature':-99999,'windspeed':-99999,'event':'0'},np.NaN)
new_df

        day  temperature  windspeed  event
0  01-01-17         32.0        6.0   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17          NaN        7.0    NaN
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0    NaN

In [4]:
new_df=df.replace({-99999:np.NaN,'0':'sunny'})
new_df

        day  temperature  windspeed  event
0  01-01-17         32.0        6.0   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17          NaN        7.0  sunny
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0  sunny

In [6]:
df

        day  temperature  windspeed  event
0  01-01-17           32          6   Rain
1  01-02-17       -99999          7  Sunny
2  01-03-17           28     -99999   Snow
3  01-04-17       -99999          7      0
4  01-05-17           32     -99999   Rain
5  01-06-17           31          2  Sunny
6  01-06-17           34          5      0

In [9]:
df=pd.DataFrame({
    'Score':['good','excelent','average','below average','poor'],
    'std_name':['thoufiq','zumma','zehad','showmik','dada']
    
})
df

           Score std_name
0           good  thoufiq
1       excelent    zumma
2        average    zehad
3  below average  showmik
4           poor     dada

In [10]:
new_df=df.replace(['good','excelent','average','below average','poor'],[3,4,2,1,0])
new_df

   Score std_name
0      3  thoufiq
1      4    zumma
2      2    zehad
3      1  showmik
4      0     dada